app/controllers/account_activations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "jiyugaoka@example.com"], ["LIMIT", 1]]
---
    def edit
        user = User.find_by(email: params[:email])