app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?)  [["content", "あすかちゃん"], ["user_id", 1], ["created_at", "2019-04-23 12:07:47.904430"], ["updated_at", "2019-04-23 12:07:47.904430"], ["picture", "img2-2.php_-3.jpeg"]]
---
    def create
        @micropost = current_user.microposts.build(micropost_params)
        if @micropost.save

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["user_id", 1], ["id", 302], ["LIMIT", 1]]
---
    def correct_user
        @micropost = current_user.microposts.find_by(id: params[:id])