app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$nLkjnSlS8tEWpkoZJ19yb.ewupsbu0fhtOd2SEb754KZ2MAA81mme"], ["updated_at", "2019-04-09 13:29:20.494686"], ["id", 101]]
---
  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, :blank)
      render 'edit'
    elsif @user.update_attributes(user_params)

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "nogizaka46@example.com"], ["LIMIT", 1]]
---
  def get_user
    @user = User.find_by(email: params[:email])