app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."activated" = ?  [["activated", 1]]
---
  def index
    @users = User.where(activated: true)

UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "nogiokun"], ["email", "nogi@example.com"], ["updated_at", "2019-04-04 12:54:57.066071"], ["id", 2]]
---
  def update
    if @user.update_attributes(user_params)